# please cite:
# @article{SqueezeNet,
#     Author = {Forrest N. Iandola and Matthew W. Moskewicz and Khalid Ashraf and Song Han and William J. Dally and Kurt Keutzer},
#     Title = {SqueezeNet: AlexNet-level accuracy with 50x fewer parameters and $<$1MB model size},
#     Journal = {arXiv:1602.07360},
#     Year = {2016}
# }
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 227
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    #source: "examples/imagenet/ilsvrc12_train_lmdb"
    source: "/home/zhuo/caffe/examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 227
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "/home/zhuo/caffe/examples/imagenet/ilsvrc12_val_lmdb_noshuffle"
    batch_size: 25 #not *iter_size
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "relu_conv1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire2/squeeze1x1"
  type: "Convolution"
  bottom: "pool1"
  top: "fire2/squeeze1x1"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire2/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire2/squeeze1x1"
  top: "fire2/squeeze1x1"
}
layer {
  name: "fire2/expand1x1"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand1x1"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire2/relu_expand1x1"
  type: "ReLU"
  bottom: "fire2/expand1x1"
  top: "fire2/expand1x1"
}
layer {
  name: "fire2/expand3x3"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand3x3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire2/relu_expand3x3"
  type: "ReLU"
  bottom: "fire2/expand3x3"
  top: "fire2/expand3x3"
}
layer {
  name: "fire2/concat"
  type: "Concat"
  bottom: "fire2/expand1x1"
  bottom: "fire2/expand3x3"
  top: "fire2/concat"
}
layer {
  name: "fire3/squeeze1x1"
  type: "Convolution"
  bottom: "fire2/concat"
  top: "fire3/squeeze1x1"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire3/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire3/squeeze1x1"
  top: "fire3/squeeze1x1"
}
layer {
  name: "fire3/expand1x1"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand1x1"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire3/relu_expand1x1"
  type: "ReLU"
  bottom: "fire3/expand1x1"
  top: "fire3/expand1x1"
}
layer {
  name: "fire3/expand3x3"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand3x3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire3/relu_expand3x3"
  type: "ReLU"
  bottom: "fire3/expand3x3"
  top: "fire3/expand3x3"
}
layer {
  name: "fire3/concat"
  type: "Concat"
  bottom: "fire3/expand1x1"
  bottom: "fire3/expand3x3"
  top: "fire3/concat"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "fire3/concat"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "fire4/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1/cluster"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire4/squeeze1x1/cluster"
  top: "fire4/squeeze1x1/cluster"
}
layer {
  name: "fire4/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/cluster"
  top: "fire4/expand1x1/cluster"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire4/expand1x1/cluster"
  top: "fire4/expand1x1/cluster"
}
layer {
  name: "fire4/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/cluster"
  top: "fire4/expand3x3/cluster"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire4/expand3x3/cluster"
  top: "fire4/expand3x3/cluster"
}
layer {
  name: "fire4/concat/cluster"
  type: "Concat"
  bottom: "fire4/expand1x1/cluster"
  bottom: "fire4/expand3x3/cluster"
  top: "fire4/concat/cluster"
}
layer {
  name: "fire5/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "fire4/concat/cluster"
  top: "fire5/squeeze1x1/cluster"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire5/squeeze1x1/cluster"
  top: "fire5/squeeze1x1/cluster"
}
layer {
  name: "fire5/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/cluster"
  top: "fire5/expand1x1/cluster"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire5/expand1x1/cluster"
  top: "fire5/expand1x1/cluster"
}
layer {
  name: "fire5/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/cluster"
  top: "fire5/expand3x3/cluster"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire5/expand3x3/cluster"
  top: "fire5/expand3x3/cluster"
}
layer {
  name: "fire5/concat/cluster"
  type: "Concat"
  bottom: "fire5/expand1x1/cluster"
  bottom: "fire5/expand3x3/cluster"
  top: "fire5/concat/cluster"
}
layer {
  name: "pool5/cluster"
  type: "Pooling"
  bottom: "fire5/concat/cluster"
  top: "pool5/cluster"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "pool5/cluster"
  top: "fire6/squeeze1x1/cluster"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire6/squeeze1x1/cluster"
  top: "fire6/squeeze1x1/cluster"
}
layer {
  name: "fire6/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/cluster"
  top: "fire6/expand1x1/cluster"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire6/expand1x1/cluster"
  top: "fire6/expand1x1/cluster"
}
layer {
  name: "fire6/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/cluster"
  top: "fire6/expand3x3/cluster"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire6/expand3x3/cluster"
  top: "fire6/expand3x3/cluster"
}
layer {
  name: "fire6/concat/cluster"
  type: "Concat"
  bottom: "fire6/expand1x1/cluster"
  bottom: "fire6/expand3x3/cluster"
  top: "fire6/concat/cluster"
}
layer {
  name: "fire7/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "fire6/concat/cluster"
  top: "fire7/squeeze1x1/cluster"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire7/squeeze1x1/cluster"
  top: "fire7/squeeze1x1/cluster"
}
layer {
  name: "fire7/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/cluster"
  top: "fire7/expand1x1/cluster"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire7/expand1x1/cluster"
  top: "fire7/expand1x1/cluster"
}
layer {
  name: "fire7/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/cluster"
  top: "fire7/expand3x3/cluster"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire7/expand3x3/cluster"
  top: "fire7/expand3x3/cluster"
}
layer {
  name: "fire7/concat/cluster"
  type: "Concat"
  bottom: "fire7/expand1x1/cluster"
  bottom: "fire7/expand3x3/cluster"
  top: "fire7/concat/cluster"
}
layer {
  name: "fire8/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "fire7/concat/cluster"
  top: "fire8/squeeze1x1/cluster"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire8/squeeze1x1/cluster"
  top: "fire8/squeeze1x1/cluster"
}
layer {
  name: "fire8/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/cluster"
  top: "fire8/expand1x1/cluster"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire8/expand1x1/cluster"
  top: "fire8/expand1x1/cluster"
}
layer {
  name: "fire8/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/cluster"
  top: "fire8/expand3x3/cluster"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire8/expand3x3/cluster"
  top: "fire8/expand3x3/cluster"
}
layer {
  name: "fire8/concat/cluster"
  type: "Concat"
  bottom: "fire8/expand1x1/cluster"
  bottom: "fire8/expand3x3/cluster"
  top: "fire8/concat/cluster"
}
layer {
  name: "fire9/squeeze1x1/cluster"
  type: "Convolution"
  bottom: "fire8/concat/cluster"
  top: "fire9/squeeze1x1/cluster"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_squeeze1x1/cluster"
  type: "ReLU"
  bottom: "fire9/squeeze1x1/cluster"
  top: "fire9/squeeze1x1/cluster"
}
layer {
  name: "fire9/expand1x1/cluster"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/cluster"
  top: "fire9/expand1x1/cluster"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand1x1/cluster"
  type: "ReLU"
  bottom: "fire9/expand1x1/cluster"
  top: "fire9/expand1x1/cluster"
}
layer {
  name: "fire9/expand3x3/cluster"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/cluster"
  top: "fire9/expand3x3/cluster"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand3x3/cluster"
  type: "ReLU"
  bottom: "fire9/expand3x3/cluster"
  top: "fire9/expand3x3/cluster"
}
layer {
  name: "fire9/concat/cluster"
  type: "Concat"
  bottom: "fire9/expand1x1/cluster"
  bottom: "fire9/expand3x3/cluster"
  top: "fire9/concat/cluster"
}
layer {
  name: "drop9/cluster"
  type: "Dropout"
  bottom: "fire9/concat/cluster"
  top: "fire9/concat/cluster"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10/cluster"
  type: "Convolution"
  bottom: "fire9/concat/cluster"
  top: "conv10/cluster"
  convolution_param {
    num_output: 4
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      mean: 0.0
      std: 0.01
    }
  }
}
#layer {
#  name: "relu_conv10/cluster"
#  type: "ReLU"
#  bottom: "conv10/cluster"
#  top: "conv10/cluster"
#}
layer {
  name: "pool10/cluster"
  type: "Pooling"
  bottom: "conv10/cluster"
  top: "pool10/cluster"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
    name: "pool10/cluster/reshape"
    type: "Reshape"
    bottom: "pool10/cluster"
    top: "pool10/cluster/reshape"
    reshape_param {
      shape {
        dim: 0  # copy the dimension from below
        dim: -1
        dim: 4 
      }
    }
  }
layer {
    name: "cluster/sig"
    type: "Sigmoid"
    bottom: "pool10/cluster/reshape"
    top: "cluster/sig"
}
layer {
    name: "cluster/thres"
    type: "Python"
    bottom: "cluster/sig"
    top: "cluster/thres"
    python_param{
	module: "threshold"
	layer: "Threshold"
    } 
}
#layer {
#    name: "cluster/softmax"
#    type: "Softmax"
#    bottom: "cluster/thres"
#    top: "cluster/softmax"
#    softmax_param{
#	axis: -1
#    }
#}
layer {
    name: "cluster/nonzeroavg"
    type: "Python"
    bottom: "cluster/thres"
    top: "cluster/nonzeroavg"
    python_param{
	module: "non_zero_avg"
	layer: "NonZeroAvg"
    } 
}

layer {
  name: "fire4/squeeze1x1/b2"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1/b2"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire4/squeeze1x1/b2"
  top: "fire4/squeeze1x1/b2"
}
layer {
  name: "fire4/expand1x1/b2"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b2"
  top: "fire4/expand1x1/b2"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire4/expand1x1/b2"
  top: "fire4/expand1x1/b2"
}
layer {
  name: "fire4/expand3x3/b2"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b2"
  top: "fire4/expand3x3/b2"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire4/expand3x3/b2"
  top: "fire4/expand3x3/b2"
}
layer {
  name: "fire4/concat/b2"
  type: "Concat"
  bottom: "fire4/expand1x1/b2"
  bottom: "fire4/expand3x3/b2"
  top: "fire4/concat/b2"
}
layer {
  name: "fire5/squeeze1x1/b2"
  type: "Convolution"
  bottom: "fire4/concat/b2"
  top: "fire5/squeeze1x1/b2"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire5/squeeze1x1/b2"
  top: "fire5/squeeze1x1/b2"
}
layer {
  name: "fire5/expand1x1/b2"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b2"
  top: "fire5/expand1x1/b2"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire5/expand1x1/b2"
  top: "fire5/expand1x1/b2"
}
layer {
  name: "fire5/expand3x3/b2"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b2"
  top: "fire5/expand3x3/b2"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire5/expand3x3/b2"
  top: "fire5/expand3x3/b2"
}
layer {
  name: "fire5/concat/b2"
  type: "Concat"
  bottom: "fire5/expand1x1/b2"
  bottom: "fire5/expand3x3/b2"
  top: "fire5/concat/b2"
}
layer {
  name: "pool5/b2"
  type: "Pooling"
  bottom: "fire5/concat/b2"
  top: "pool5/b2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1/b2"
  type: "Convolution"
  bottom: "pool5/b2"
  top: "fire6/squeeze1x1/b2"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire6/squeeze1x1/b2"
  top: "fire6/squeeze1x1/b2"
}
layer {
  name: "fire6/expand1x1/b2"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b2"
  top: "fire6/expand1x1/b2"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire6/expand1x1/b2"
  top: "fire6/expand1x1/b2"
}
layer {
  name: "fire6/expand3x3/b2"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b2"
  top: "fire6/expand3x3/b2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire6/expand3x3/b2"
  top: "fire6/expand3x3/b2"
}
layer {
  name: "fire6/concat/b2"
  type: "Concat"
  bottom: "fire6/expand1x1/b2"
  bottom: "fire6/expand3x3/b2"
  top: "fire6/concat/b2"
}
layer {
  name: "fire7/squeeze1x1/b2"
  type: "Convolution"
  bottom: "fire6/concat/b2"
  top: "fire7/squeeze1x1/b2"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire7/squeeze1x1/b2"
  top: "fire7/squeeze1x1/b2"
}
layer {
  name: "fire7/expand1x1/b2"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b2"
  top: "fire7/expand1x1/b2"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire7/expand1x1/b2"
  top: "fire7/expand1x1/b2"
}
layer {
  name: "fire7/expand3x3/b2"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b2"
  top: "fire7/expand3x3/b2"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire7/expand3x3/b2"
  top: "fire7/expand3x3/b2"
}
layer {
  name: "fire7/concat/b2"
  type: "Concat"
  bottom: "fire7/expand1x1/b2"
  bottom: "fire7/expand3x3/b2"
  top: "fire7/concat/b2"
}
layer {
  name: "fire8/squeeze1x1/b2"
  type: "Convolution"
  bottom: "fire7/concat/b2"
  top: "fire8/squeeze1x1/b2"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire8/squeeze1x1/b2"
  top: "fire8/squeeze1x1/b2"
}
layer {
  name: "fire8/expand1x1/b2"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b2"
  top: "fire8/expand1x1/b2"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire8/expand1x1/b2"
  top: "fire8/expand1x1/b2"
}
layer {
  name: "fire8/expand3x3/b2"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b2"
  top: "fire8/expand3x3/b2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire8/expand3x3/b2"
  top: "fire8/expand3x3/b2"
}
layer {
  name: "fire8/concat/b2"
  type: "Concat"
  bottom: "fire8/expand1x1/b2"
  bottom: "fire8/expand3x3/b2"
  top: "fire8/concat/b2"
}
layer {
  name: "fire9/squeeze1x1/b2"
  type: "Convolution"
  bottom: "fire8/concat/b2"
  top: "fire9/squeeze1x1/b2"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_squeeze1x1/b2"
  type: "ReLU"
  bottom: "fire9/squeeze1x1/b2"
  top: "fire9/squeeze1x1/b2"
}
layer {
  name: "fire9/expand1x1/b2"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b2"
  top: "fire9/expand1x1/b2"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand1x1/b2"
  type: "ReLU"
  bottom: "fire9/expand1x1/b2"
  top: "fire9/expand1x1/b2"
}
layer {
  name: "fire9/expand3x3/b2"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b2"
  top: "fire9/expand3x3/b2"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand3x3/b2"
  type: "ReLU"
  bottom: "fire9/expand3x3/b2"
  top: "fire9/expand3x3/b2"
}
layer {
  name: "fire9/concat/b2"
  type: "Concat"
  bottom: "fire9/expand1x1/b2"
  bottom: "fire9/expand3x3/b2"
  top: "fire9/concat/b2"
}
layer {
  name: "drop9/b2"
  type: "Dropout"
  bottom: "fire9/concat/b2"
  top: "fire9/concat/b2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10/b2"
  type: "Convolution"
  bottom: "fire9/concat/b2"
  top: "conv10/b2"
  convolution_param {
    num_output: 1000
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      mean: 0.0
      std: 0.01
    }
  }
}
layer {
  name: "relu_conv10/b2"
  type: "ReLU"
  bottom: "conv10/b2"
  top: "conv10/b2"
}
layer {
  name: "pool10/b2"
  type: "Pooling"
  bottom: "conv10/b2"
  top: "pool10/b2"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
    name: "softmax/b2"
    type: "Softmax"
    bottom: "pool10/b2"
    top: "softmax/b2"
}
layer {
  name: "fire4/squeeze1x1/b3"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1/b3"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire4/squeeze1x1/b3"
  top: "fire4/squeeze1x1/b3"
}
layer {
  name: "fire4/expand1x1/b3"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b3"
  top: "fire4/expand1x1/b3"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire4/expand1x1/b3"
  top: "fire4/expand1x1/b3"
}
layer {
  name: "fire4/expand3x3/b3"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b3"
  top: "fire4/expand3x3/b3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire4/expand3x3/b3"
  top: "fire4/expand3x3/b3"
}
layer {
  name: "fire4/concat/b3"
  type: "Concat"
  bottom: "fire4/expand1x1/b3"
  bottom: "fire4/expand3x3/b3"
  top: "fire4/concat/b3"
}
layer {
  name: "fire5/squeeze1x1/b3"
  type: "Convolution"
  bottom: "fire4/concat/b3"
  top: "fire5/squeeze1x1/b3"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire5/squeeze1x1/b3"
  top: "fire5/squeeze1x1/b3"
}
layer {
  name: "fire5/expand1x1/b3"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b3"
  top: "fire5/expand1x1/b3"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire5/expand1x1/b3"
  top: "fire5/expand1x1/b3"
}
layer {
  name: "fire5/expand3x3/b3"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b3"
  top: "fire5/expand3x3/b3"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire5/expand3x3/b3"
  top: "fire5/expand3x3/b3"
}
layer {
  name: "fire5/concat/b3"
  type: "Concat"
  bottom: "fire5/expand1x1/b3"
  bottom: "fire5/expand3x3/b3"
  top: "fire5/concat/b3"
}
layer {
  name: "pool5/b3"
  type: "Pooling"
  bottom: "fire5/concat/b3"
  top: "pool5/b3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1/b3"
  type: "Convolution"
  bottom: "pool5/b3"
  top: "fire6/squeeze1x1/b3"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire6/squeeze1x1/b3"
  top: "fire6/squeeze1x1/b3"
}
layer {
  name: "fire6/expand1x1/b3"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b3"
  top: "fire6/expand1x1/b3"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire6/expand1x1/b3"
  top: "fire6/expand1x1/b3"
}
layer {
  name: "fire6/expand3x3/b3"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b3"
  top: "fire6/expand3x3/b3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire6/expand3x3/b3"
  top: "fire6/expand3x3/b3"
}
layer {
  name: "fire6/concat/b3"
  type: "Concat"
  bottom: "fire6/expand1x1/b3"
  bottom: "fire6/expand3x3/b3"
  top: "fire6/concat/b3"
}
layer {
  name: "fire7/squeeze1x1/b3"
  type: "Convolution"
  bottom: "fire6/concat/b3"
  top: "fire7/squeeze1x1/b3"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire7/squeeze1x1/b3"
  top: "fire7/squeeze1x1/b3"
}
layer {
  name: "fire7/expand1x1/b3"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b3"
  top: "fire7/expand1x1/b3"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire7/expand1x1/b3"
  top: "fire7/expand1x1/b3"
}
layer {
  name: "fire7/expand3x3/b3"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b3"
  top: "fire7/expand3x3/b3"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire7/expand3x3/b3"
  top: "fire7/expand3x3/b3"
}
layer {
  name: "fire7/concat/b3"
  type: "Concat"
  bottom: "fire7/expand1x1/b3"
  bottom: "fire7/expand3x3/b3"
  top: "fire7/concat/b3"
}
layer {
  name: "fire8/squeeze1x1/b3"
  type: "Convolution"
  bottom: "fire7/concat/b3"
  top: "fire8/squeeze1x1/b3"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire8/squeeze1x1/b3"
  top: "fire8/squeeze1x1/b3"
}
layer {
  name: "fire8/expand1x1/b3"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b3"
  top: "fire8/expand1x1/b3"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire8/expand1x1/b3"
  top: "fire8/expand1x1/b3"
}
layer {
  name: "fire8/expand3x3/b3"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b3"
  top: "fire8/expand3x3/b3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire8/expand3x3/b3"
  top: "fire8/expand3x3/b3"
}
layer {
  name: "fire8/concat/b3"
  type: "Concat"
  bottom: "fire8/expand1x1/b3"
  bottom: "fire8/expand3x3/b3"
  top: "fire8/concat/b3"
}
layer {
  name: "fire9/squeeze1x1/b3"
  type: "Convolution"
  bottom: "fire8/concat/b3"
  top: "fire9/squeeze1x1/b3"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_squeeze1x1/b3"
  type: "ReLU"
  bottom: "fire9/squeeze1x1/b3"
  top: "fire9/squeeze1x1/b3"
}
layer {
  name: "fire9/expand1x1/b3"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b3"
  top: "fire9/expand1x1/b3"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand1x1/b3"
  type: "ReLU"
  bottom: "fire9/expand1x1/b3"
  top: "fire9/expand1x1/b3"
}
layer {
  name: "fire9/expand3x3/b3"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b3"
  top: "fire9/expand3x3/b3"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand3x3/b3"
  type: "ReLU"
  bottom: "fire9/expand3x3/b3"
  top: "fire9/expand3x3/b3"
}
layer {
  name: "fire9/concat/b3"
  type: "Concat"
  bottom: "fire9/expand1x1/b3"
  bottom: "fire9/expand3x3/b3"
  top: "fire9/concat/b3"
}
layer {
  name: "drop9/b3"
  type: "Dropout"
  bottom: "fire9/concat/b3"
  top: "fire9/concat/b3"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10/b3"
  type: "Convolution"
  bottom: "fire9/concat/b3"
  top: "conv10/b3"
  convolution_param {
    num_output: 1000
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      mean: 0.0
      std: 0.01
    }
  }
}
layer {
  name: "relu_conv10/b3"
  type: "ReLU"
  bottom: "conv10/b3"
  top: "conv10/b3"
}
layer {
  name: "pool10/b3"
  type: "Pooling"
  bottom: "conv10/b3"
  top: "pool10/b3"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
    name: "softmax/b3"
    type: "Softmax"
    bottom: "pool10/b3"
    top: "softmax/b3"
}
layer {
  name: "fire4/squeeze1x1/b1"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1/b1"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire4/squeeze1x1/b1"
  top: "fire4/squeeze1x1/b1"
}
layer {
  name: "fire4/expand1x1/b1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b1"
  top: "fire4/expand1x1/b1"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire4/expand1x1/b1"
  top: "fire4/expand1x1/b1"
}
layer {
  name: "fire4/expand3x3/b1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b1"
  top: "fire4/expand3x3/b1"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire4/expand3x3/b1"
  top: "fire4/expand3x3/b1"
}
layer {
  name: "fire4/concat/b1"
  type: "Concat"
  bottom: "fire4/expand1x1/b1"
  bottom: "fire4/expand3x3/b1"
  top: "fire4/concat/b1"
}
layer {
  name: "fire5/squeeze1x1/b1"
  type: "Convolution"
  bottom: "fire4/concat/b1"
  top: "fire5/squeeze1x1/b1"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire5/squeeze1x1/b1"
  top: "fire5/squeeze1x1/b1"
}
layer {
  name: "fire5/expand1x1/b1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b1"
  top: "fire5/expand1x1/b1"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire5/expand1x1/b1"
  top: "fire5/expand1x1/b1"
}
layer {
  name: "fire5/expand3x3/b1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b1"
  top: "fire5/expand3x3/b1"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire5/expand3x3/b1"
  top: "fire5/expand3x3/b1"
}
layer {
  name: "fire5/concat/b1"
  type: "Concat"
  bottom: "fire5/expand1x1/b1"
  bottom: "fire5/expand3x3/b1"
  top: "fire5/concat/b1"
}
layer {
  name: "pool5/b1"
  type: "Pooling"
  bottom: "fire5/concat/b1"
  top: "pool5/b1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1/b1"
  type: "Convolution"
  bottom: "pool5/b1"
  top: "fire6/squeeze1x1/b1"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire6/squeeze1x1/b1"
  top: "fire6/squeeze1x1/b1"
}
layer {
  name: "fire6/expand1x1/b1"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b1"
  top: "fire6/expand1x1/b1"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire6/expand1x1/b1"
  top: "fire6/expand1x1/b1"
}
layer {
  name: "fire6/expand3x3/b1"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b1"
  top: "fire6/expand3x3/b1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire6/expand3x3/b1"
  top: "fire6/expand3x3/b1"
}
layer {
  name: "fire6/concat/b1"
  type: "Concat"
  bottom: "fire6/expand1x1/b1"
  bottom: "fire6/expand3x3/b1"
  top: "fire6/concat/b1"
}
layer {
  name: "fire7/squeeze1x1/b1"
  type: "Convolution"
  bottom: "fire6/concat/b1"
  top: "fire7/squeeze1x1/b1"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire7/squeeze1x1/b1"
  top: "fire7/squeeze1x1/b1"
}
layer {
  name: "fire7/expand1x1/b1"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b1"
  top: "fire7/expand1x1/b1"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire7/expand1x1/b1"
  top: "fire7/expand1x1/b1"
}
layer {
  name: "fire7/expand3x3/b1"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b1"
  top: "fire7/expand3x3/b1"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire7/expand3x3/b1"
  top: "fire7/expand3x3/b1"
}
layer {
  name: "fire7/concat/b1"
  type: "Concat"
  bottom: "fire7/expand1x1/b1"
  bottom: "fire7/expand3x3/b1"
  top: "fire7/concat/b1"
}
layer {
  name: "fire8/squeeze1x1/b1"
  type: "Convolution"
  bottom: "fire7/concat/b1"
  top: "fire8/squeeze1x1/b1"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire8/squeeze1x1/b1"
  top: "fire8/squeeze1x1/b1"
}
layer {
  name: "fire8/expand1x1/b1"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b1"
  top: "fire8/expand1x1/b1"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire8/expand1x1/b1"
  top: "fire8/expand1x1/b1"
}
layer {
  name: "fire8/expand3x3/b1"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b1"
  top: "fire8/expand3x3/b1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire8/expand3x3/b1"
  top: "fire8/expand3x3/b1"
}
layer {
  name: "fire8/concat/b1"
  type: "Concat"
  bottom: "fire8/expand1x1/b1"
  bottom: "fire8/expand3x3/b1"
  top: "fire8/concat/b1"
}
layer {
  name: "fire9/squeeze1x1/b1"
  type: "Convolution"
  bottom: "fire8/concat/b1"
  top: "fire9/squeeze1x1/b1"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_squeeze1x1/b1"
  type: "ReLU"
  bottom: "fire9/squeeze1x1/b1"
  top: "fire9/squeeze1x1/b1"
}
layer {
  name: "fire9/expand1x1/b1"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b1"
  top: "fire9/expand1x1/b1"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand1x1/b1"
  type: "ReLU"
  bottom: "fire9/expand1x1/b1"
  top: "fire9/expand1x1/b1"
}
layer {
  name: "fire9/expand3x3/b1"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b1"
  top: "fire9/expand3x3/b1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand3x3/b1"
  type: "ReLU"
  bottom: "fire9/expand3x3/b1"
  top: "fire9/expand3x3/b1"
}
layer {
  name: "fire9/concat/b1"
  type: "Concat"
  bottom: "fire9/expand1x1/b1"
  bottom: "fire9/expand3x3/b1"
  top: "fire9/concat/b1"
}
layer {
  name: "drop9/b1"
  type: "Dropout"
  bottom: "fire9/concat/b1"
  top: "fire9/concat/b1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10/b1"
  type: "Convolution"
  bottom: "fire9/concat/b1"
  top: "conv10/b1"
  convolution_param {
    num_output: 1000
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      mean: 0.0
      std: 0.01
    }
  }
}
layer {
  name: "relu_conv10/b1"
  type: "ReLU"
  bottom: "conv10/b1"
  top: "conv10/b1"
}
layer {
  name: "pool10/b1"
  type: "Pooling"
  bottom: "conv10/b1"
  top: "pool10/b1"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
    name: "softmax/b1"
    type: "Softmax"
    bottom: "pool10/b1"
    top: "softmax/b1"
}
layer {
  name: "fire4/squeeze1x1/b4"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1/b4"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire4/squeeze1x1/b4"
  top: "fire4/squeeze1x1/b4"
}
layer {
  name: "fire4/expand1x1/b4"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b4"
  top: "fire4/expand1x1/b4"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire4/expand1x1/b4"
  top: "fire4/expand1x1/b4"
}
layer {
  name: "fire4/expand3x3/b4"
  type: "Convolution"
  bottom: "fire4/squeeze1x1/b4"
  top: "fire4/expand3x3/b4"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire4/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire4/expand3x3/b4"
  top: "fire4/expand3x3/b4"
}
layer {
  name: "fire4/concat/b4"
  type: "Concat"
  bottom: "fire4/expand1x1/b4"
  bottom: "fire4/expand3x3/b4"
  top: "fire4/concat/b4"
}
layer {
  name: "fire5/squeeze1x1/b4"
  type: "Convolution"
  bottom: "fire4/concat/b4"
  top: "fire5/squeeze1x1/b4"
  convolution_param {
    num_output: 8
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire5/squeeze1x1/b4"
  top: "fire5/squeeze1x1/b4"
}
layer {
  name: "fire5/expand1x1/b4"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b4"
  top: "fire5/expand1x1/b4"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire5/expand1x1/b4"
  top: "fire5/expand1x1/b4"
}
layer {
  name: "fire5/expand3x3/b4"
  type: "Convolution"
  bottom: "fire5/squeeze1x1/b4"
  top: "fire5/expand3x3/b4"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire5/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire5/expand3x3/b4"
  top: "fire5/expand3x3/b4"
}
layer {
  name: "fire5/concat/b4"
  type: "Concat"
  bottom: "fire5/expand1x1/b4"
  bottom: "fire5/expand3x3/b4"
  top: "fire5/concat/b4"
}
layer {
  name: "pool5/b4"
  type: "Pooling"
  bottom: "fire5/concat/b4"
  top: "pool5/b4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1/b4"
  type: "Convolution"
  bottom: "pool5/b4"
  top: "fire6/squeeze1x1/b4"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire6/squeeze1x1/b4"
  top: "fire6/squeeze1x1/b4"
}
layer {
  name: "fire6/expand1x1/b4"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b4"
  top: "fire6/expand1x1/b4"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire6/expand1x1/b4"
  top: "fire6/expand1x1/b4"
}
layer {
  name: "fire6/expand3x3/b4"
  type: "Convolution"
  bottom: "fire6/squeeze1x1/b4"
  top: "fire6/expand3x3/b4"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire6/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire6/expand3x3/b4"
  top: "fire6/expand3x3/b4"
}
layer {
  name: "fire6/concat/b4"
  type: "Concat"
  bottom: "fire6/expand1x1/b4"
  bottom: "fire6/expand3x3/b4"
  top: "fire6/concat/b4"
}
layer {
  name: "fire7/squeeze1x1/b4"
  type: "Convolution"
  bottom: "fire6/concat/b4"
  top: "fire7/squeeze1x1/b4"
  convolution_param {
    num_output: 12
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire7/squeeze1x1/b4"
  top: "fire7/squeeze1x1/b4"
}
layer {
  name: "fire7/expand1x1/b4"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b4"
  top: "fire7/expand1x1/b4"
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire7/expand1x1/b4"
  top: "fire7/expand1x1/b4"
}
layer {
  name: "fire7/expand3x3/b4"
  type: "Convolution"
  bottom: "fire7/squeeze1x1/b4"
  top: "fire7/expand3x3/b4"
  convolution_param {
    num_output: 48
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire7/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire7/expand3x3/b4"
  top: "fire7/expand3x3/b4"
}
layer {
  name: "fire7/concat/b4"
  type: "Concat"
  bottom: "fire7/expand1x1/b4"
  bottom: "fire7/expand3x3/b4"
  top: "fire7/concat/b4"
}
layer {
  name: "fire8/squeeze1x1/b4"
  type: "Convolution"
  bottom: "fire7/concat/b4"
  top: "fire8/squeeze1x1/b4"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire8/squeeze1x1/b4"
  top: "fire8/squeeze1x1/b4"
}
layer {
  name: "fire8/expand1x1/b4"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b4"
  top: "fire8/expand1x1/b4"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire8/expand1x1/b4"
  top: "fire8/expand1x1/b4"
}
layer {
  name: "fire8/expand3x3/b4"
  type: "Convolution"
  bottom: "fire8/squeeze1x1/b4"
  top: "fire8/expand3x3/b4"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire8/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire8/expand3x3/b4"
  top: "fire8/expand3x3/b4"
}
layer {
  name: "fire8/concat/b4"
  type: "Concat"
  bottom: "fire8/expand1x1/b4"
  bottom: "fire8/expand3x3/b4"
  top: "fire8/concat/b4"
}
layer {
  name: "fire9/squeeze1x1/b4"
  type: "Convolution"
  bottom: "fire8/concat/b4"
  top: "fire9/squeeze1x1/b4"
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_squeeze1x1/b4"
  type: "ReLU"
  bottom: "fire9/squeeze1x1/b4"
  top: "fire9/squeeze1x1/b4"
}
layer {
  name: "fire9/expand1x1/b4"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b4"
  top: "fire9/expand1x1/b4"
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand1x1/b4"
  type: "ReLU"
  bottom: "fire9/expand1x1/b4"
  top: "fire9/expand1x1/b4"
}
layer {
  name: "fire9/expand3x3/b4"
  type: "Convolution"
  bottom: "fire9/squeeze1x1/b4"
  top: "fire9/expand3x3/b4"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "fire9/relu_expand3x3/b4"
  type: "ReLU"
  bottom: "fire9/expand3x3/b4"
  top: "fire9/expand3x3/b4"
}
layer {
  name: "fire9/concat/b4"
  type: "Concat"
  bottom: "fire9/expand1x1/b4"
  bottom: "fire9/expand3x3/b4"
  top: "fire9/concat/b4"
}
layer {
  name: "drop9/b4"
  type: "Dropout"
  bottom: "fire9/concat/b4"
  top: "fire9/concat/b4"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10/b4"
  type: "Convolution"
  bottom: "fire9/concat/b4"
  top: "conv10/b4"
  convolution_param {
    num_output: 1000
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      mean: 0.0
      std: 0.01
    }
  }
}
layer {
  name: "relu_conv10/b4"
  type: "ReLU"
  bottom: "conv10/b4"
  top: "conv10/b4"
}
layer {
  name: "pool10/b4"
  type: "Pooling"
  bottom: "conv10/b4"
  top: "pool10/b4"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
    name: "softmax/b4"
    type: "Softmax"
    bottom: "pool10/b4"
    top: "softmax/b4"
}

layer {
  name: "final/concat"
  type: "Concat"
  bottom: "softmax/b1"
  bottom: "softmax/b2"
  bottom: "softmax/b3"
  bottom: "softmax/b4"
  top: "final/concat"
}
layer {
    name: "final/concat/reshape"
    type: "Reshape"
    bottom: "final/concat"
    top: "final/concat/reshape"
    reshape_param {
      shape {
        dim: 0  # copy the dimension from below
        dim: -1
        dim: 1000 
      }
    }
  }

layer {
  type: 'Python'
  name: 'matvec'
  top: 'matvec'
  bottom: 'cluster/nonzeroavg'
  bottom: 'final/concat/reshape'
  python_param {
    # the module name -- usually the filename -- that needs to be in $PYTHONPATH
    module: 'py_matvec_layer'
    # the layer name -- the class name in the module
    layer: 'MatvecLayer'
  }
}

layer {
    name: "matvec/reshape"
    type: "Reshape"
    bottom: "matvec"
    top: "matvec/reshape"
    reshape_param {
      shape {
        dim: 0  # copy the dimension from below
        dim: 1000 
      }
    }
  }

#layer{
#  name: "fc"
#  type: "InnerProduct"
#  bottom: "matvec"
#  top: "fc"
#  param{
#    lr_mult:1
#    decay_mult:1
#  }
#  inner_product_param{
#    num_output:1000
#  }
#}
layer {
  name: "loss"
  type: "MultinomialLogisticLoss"
  bottom: "matvec/reshape"
  bottom: "label"
  top: "loss"
  #include {
  #  phase: TRAIN
  #}
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "matvec/reshape"
  bottom: "label"
  top: "accuracy"
  #include {
  #  phase: TEST
  #}
}
layer {
  name: "accuracy_top5"
  type: "Accuracy"
  bottom: "matvec/reshape"
  bottom: "label"
  top: "accuracy_top5"
  #include {
  #  phase: TEST
  #}
  accuracy_param {
    top_k: 5
  }
}
